function simulation(sim_step)

% Temperature--> Temperature of fractionator stages (from top to bottom)
% Ttrack--> Cut points for products [HN,LCO]
% SPfrac--> Set points fractionator
% ProductsMB--> Feed, coke, products, slurry and reflux flowrates
% LPG--> LPG molar flowrate
% MVfrac--> MVs fractionator (duties, PA flowrates)
% products-->Reflux,HN and LCO flowrates
% xfil-->Filtered reactor output values
% Valvesfrac-->Fractionator valve position value

global yp
 %States for the filter (dist+P)
% --------------------------------------------------------

%%%%%%%%%%%%%%%%%%%%%%%%%%FCC Initial Data%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
xfcc = [1564.06758445685, 616, 24.0440758965397, 24.9000000145994, 40.0420669348231, 28.0000000041903, 3.16075658859897, 35.0875282505755, 0.0101439627122109, 0.00250580481493606, 1249.99997383664, 9350.79072581430, 271210.435908199, 246.810877809621, 98098.9991960623, 968.999859177516, 2.68045714195376, 30.4463683645626, 14.6380093682365, -24.2765676899209, -0.612986761842691, 0.611929610398922, -5641.47052429781, -30153150.1669079, -1879.52204006479, 0.00468987379029097, 0.0481251434795964, 0.527273962836787, 0.357213788281919, 2.47339657486076, 1.41455228053760, 2.70179775410060, 2.44381704476869, 0.631637205219422, 0.627951527686494, 457.718461235902, 6.31203102548586];
ufcc = [165, 0, 1, 0, 0, 0, 0.431260000000000, 0, 0, 616, 24.9000000000000, 28, 1250, 98100, 969]; % LAST 6 COMPONENTS ARE THE SET POINTS FOR FCC.
%Detailed definiton of each ufcc component can be found in FCC.m file
dist = [75, 25, 460.900000000000, 0.900000000000000]; %DISTURBANCES
%Detailed definiton of each dist component can be found in FCC.m file
Flpg = 457.718467816417;
Tcondenser = 310.707095521277;

%%%%%%%%%%%%%%%%%%%%%Fractionator Initial Data%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
MV = [0.747045932872508; 298.895742822403; 32; 216.5; 35.0441537396814; 1243.39471672084];
ufra = [1647.78648413911; 3547.63742893480; 3382.54085689940; 3077.23029277231; 3039.30039378578; 3038.30153796675; 3031.04170871230; 2992.96394430377; 2929.38471956076; 3035.21348344919; 3023.22094129519; 3055.92931441955; 3054.01364490236; 3044.12036102462; 3036.53284553629; 3032.88546649540; 3031.43608755138; 3030.73615977709; 3031.85542990300; 3317.69553572937; 310.707095521277; 392.000195034657; 423.489189888333; 449.071037007143; 455.829436826681; 457.278865297285; 458.591772080347; 463.785597803382; 472.370698542057; 509.816789386916; 517.590163820810; 519.337427827793; 520.027072886078; 521.878006501369; 523.251988845496; 523.948479342715; 524.270766239095; 524.490435402004; 594.289627412580; 628.139421202578];
xfra = [69.9992488400148; 10.6316859735314; 5.54317455602710; 4.91100895722520; 4.89436078215364; 3.09047029825112; 2.45584074341618; 1.39618700941233; 3.74406892836788; 3.54419293748662; 3.50526289424775; 3.47333455975866; 0.581208632217122; 0.454748252715454; 0.393957106911256; 0.369799493313600; 0.358132864975684; 21.1000283535949; 25.8640187364202; 0.332060339295454; -0.224208017297567; -0.246522780582604; -0.310253017194136; -0.335719668638253; -0.338098963445289; -0.338858427183761; -0.345902800895044; -0.377049332312538; -0.414759572319589; -0.430408083956499; -0.433430113589529; -0.434099943180356; -0.435987977736354; -0.447571182665404; -0.455658696962468; -0.459238836223210; -0.460571288645674; -0.461449885379717; -0.438370329521518; -0.445316469740412; -0.112072792215712; -0.142025512847148; -0.142222571040525; -0.138762351945039; -0.139091175556689; -0.139256499719380; -0.138852001804254; -0.136654245646270; -0.133003418846954; -0.136537633847564; -0.136534687842125; -0.136518050403360; -0.136377516308497; -0.135533047296566; -0.134886368848381; -0.134573362425308; -0.134446050237712; -0.134380488991606; -0.174913487206278; -0.188804971011267; 802.998070714435; 637.901158411887; 332.590473361626; 294.660537433512; 293.661646929218; 185.428217895067; 147.350444604971; 83.7712205647395; 224.644135702073; 212.651576249197; 210.315773654865; 208.400073585520; 34.8725179330273; 27.2848951629272; 23.6374264146753; 22.1879695988160; 21.4879718985410; 1266.00170121569; 1551.84112418521; 16.6030169647727];
xc = [0.000730235602087646, 0.00372006166875014, 0.0449160106227330, 0.139356343425088, 0.240492627626492, 0.569407502810893, 0.00137721823703024, 6.92087648762089e-12, 2.04168509426954e-26, -2.61959392296970e-32; 0.000334414014146372, 0.00101897523290478, 0.00909809956114959, 0.0245075757206946, 0.0715197965665978, 0.805646930325290, 0.0878741953189763, 1.32602379525904e-08, 1.29974453508235e-21, -1.98249322448692e-26; 0.000342118151941009, 0.000893370382498736, 0.00695902081404365, 0.0156121143250025, 0.0314699456549243, 0.399614511665990, 0.545107423462561, 1.49554304830301e-06, 2.96879527394061e-18, -2.75777850354419e-22; 0.000371388883508717, 0.000877397119630828, 0.00634125405177895, 0.0131255127127142, 0.0215961342254390, 0.171830359349128, 0.785828872994828, 2.90806629994151e-05, 8.42206265615051e-16, -1.80720718410264e-19; 0.000376010088946707, 0.000867105833276753, 0.00615685670928431, 0.0125119274032362, 0.0197775706298387, 0.137004471256256, 0.822924231092917, 0.000381826986099046, 1.49185925868036e-13, -5.52729229133610e-18; 0.000377686686936986, 0.000866438571228639, 0.00612870663488887, 0.0124061114677264, 0.0194546642445798, 0.131871471895551, 0.824176152207220, 0.00471876826742203, 2.44541519224196e-11, -5.00042931705508e-18; 0.000382424464862341, 0.000872714357434769, 0.00614904136734986, 0.0123981956806917, 0.0192966364602325, 0.129311838919261, 0.777598256545508, 0.0539908885592787, 3.64539017432342e-09, 2.64911772315457e-18; 0.000400024361159347, 0.000894464046521220, 0.00620717285729142, 0.0123246547582017, 0.0186353777333138, 0.120111722966723, 0.567507352385685, 0.273919017903400, 2.12987711525807e-07, 3.97613996517875e-15; 0.000427241272341516, 0.000925755578058187, 0.00627589413791006, 0.0121702193459629, 0.0176002587126851, 0.106771477968750, 0.303198883002485, 0.552625672209204, 4.59777197822388e-06, 6.31957010925434e-13; 0.000407916325876747, 0.000793998858013799, 0.00498411857163051, 0.00895451675892823, 0.0112995627973560, 0.0588093259148082, 0.131227318685345, 0.783477776273698, 4.54657911118516e-05, 2.32345765950015e-11; 0.000412498322946457, 0.000786765714755351, 0.00486595642129017, 0.00861093864290391, 0.0105525371159684, 0.0525248500042417, 0.0817559529664807, 0.840138634350095, 0.000351865520279224, 9.41039657478064e-10; 0.000415155511979851, 0.000788232479792742, 0.00485884617664370, 0.00856952430654025, 0.0104356385084450, 0.0514852009202325, 0.0715441547694136, 0.849372900295214, 0.00253031204434431, 3.49873936726212e-08; 0.000418360041155387, 0.000792769986141187, 0.00487966144310618, 0.00859353569841551, 0.0104360573494958, 0.0513038373319371, 0.0692294158287375, 0.836734392764956, 0.0176107175926509, 1.25196340150351e-06; 0.000427546260085840, 0.000805887972276076, 0.00494005727792305, 0.00866390904419732, 0.0104402136533784, 0.0508309412334667, 0.0664551855722971, 0.748314031869416, 0.109083000839452, 3.92262775067903e-05; 0.000435251299540706, 0.000817153698635069, 0.00499374213634322, 0.00873095847947023, 0.0104602272900075, 0.0505628114883548, 0.0647351428226610, 0.685024872680089, 0.174050512715489, 0.000189327389406824; 0.000440155250103753, 0.000824648894646010, 0.00503150547762483, 0.00878283682022606, 0.0104908347464279, 0.0505221650529794, 0.0640013231762480, 0.656191870114909, 0.203040134656338, 0.000674525810499191; 0.000443502100289954, 0.000830064244467471, 0.00506053522234762, 0.00882646341733982, 0.0105273010849871, 0.0506049588009945, 0.0637876034966238, 0.645424036922622, 0.212336574881648, 0.00215895982867887; 0.000446517466546717, 0.000835077087487109, 0.00508812112220212, 0.00886935714915974, 0.0105668971603744, 0.0507273893435450, 0.0637247509928538, 0.640446001911348, 0.212719562435708, 0.00657632533077642; 0.000332071030021883, 0.000539365817469141, 0.00297548888672389, 0.00470816869014084, 0.00476067446478888, 0.0195481864673815, 0.0266278610329684, 0.544238039047297, 0.379906302722132, 0.0163638418410765; 0.000320842222488389, 0.000491881890237686, 0.00259910319544938, 0.00393312933850515, 0.00364120715415336, 0.0130801198927189, 0.0112100934166477, 0.281216487377775, 0.607390131596276, 0.0761170039157492];
SP = [70; 245.93; 530.33; 755.33]; %SET POINTS FOR FRACTIONATOR
Distillateini = xfra(20 * 3 + 1) / MV(1);
products = [Distillateini; 100.973572040226; 163.634173822281];
errord = [0.136692017830002; -0.0707331131770190; -0.352870002514544; -2.77937044322705];
Xfilin = [3025.85220559869, 793.705291729987, 0.0559148422896900, 0.0562430796039667, 0.217605876121722, 0.240577895792075, 0.125956811268771, 0.220240485954903, 0.0318076418832473, 0.0469505105292196, 0.00428524729043614, 0.000417609265968941, 1.71679455003844]'; %States for the

dist = [80.0000, 25.0000, 460.9000, 0.8800];
Xfilin = [3025.859115, 793.704255, 0.055913, 0.056242, 0.217603, 0.240579, 0.125957, 0.220243, 0.031808, 0.046951, 0.004285, 0.000418, 1.716863];


h = sim_step; %%%LOOK FOR TIME STEP%%% (5 seconds)
%%%%%%%%%%%%%%%%%%%%FRACTIONATOR VARIABLES(RESULTS) DEFINITION%%%%%%%%%%%%%
Temperature=[];
Vapor=[];
Comp1=[];
Comp2=[];
Comp3=[];
Comp4=[];
Comp5=[];
Comp6=[];
Comp7=[];
Comp8=[];
Comp9=[];
Comp10=[];
Liquid=[];
Holdup=[];
EnthalL=[];
EnthalV=[];
Ttrack=[];
time=[];
SPfrac=[];
Valvesfrac=[];
ProductsMB=[];
LPG=[];
xfil=[];
MVfrac=[]; 
%%%%%%%%%%%%%%%SET THE SIMULATION TIME(ST) IN MINUTES%%%%%%%%%%%%%%
% ST=3;

MWp5 = 446.094358949534;
MWp4 = 378.894679684485;
MWp3 = 292.185529267655;
MWp2 = 206.951432493898;
MWp1 = 120.941794467086;
MWc5 = 85.1347950005991;
MWb = 58.12;
MWp = 44.1 ;
MWe = 30.07;
MWm = 16.04;

sim_cnt = 0;
PI_sensors = [69.99924884, 392.00019503, 549.99917972, 675.01631067];
actors  = [50, 50, 50, 50];
MV_SP   = [794.1439863, 3029.421441, 1.717015617];

PLC1_sensors = [];
PLC2_sensors = [];

PLC1_Actor_data_file_path = './data/FCC_json/PLC1_actors.json';
PLC2_Actor_data_file_path = './data/FCC_json/PLC2_actors.json';
PLC1_Sensor_data_file_path = './data/FCC_json/PLC1_sensors.json';
PLC2_Sensor_data_file_path = './data/FCC_json/PLC2_sensors.json';

% 初始化文�?
PLC1_sensor_data = struct('sensors', PLC1_sensors, 'sim_cnt', 0);
fid = fopen(PLC1_Sensor_data_file_path, 'w');
fwrite(fid, jsonencode(PLC1_sensor_data));
fclose(fid);
% 初始化文�?
PLC2_sensor_data = struct('sensors', PLC2_sensors, 'sim_cnt', 0);
fid = fopen(PLC2_Sensor_data_file_path, 'w');
fwrite(fid, jsonencode(PLC2_sensor_data));
fclose(fid);

JSON_TIMEOUT    = 7;
WAIT_TIMEOUT    = 12;
simualtion_flag = false;
waiting_time    = 0;
sim_period      = 2;

while true

    PLC1_Actor_raw_data  = fileread(PLC1_Actor_data_file_path);
    PLC1_controller_data = jsondecode(PLC1_Actor_raw_data);
    PLC2_Actor_raw_data  = fileread(PLC2_Actor_data_file_path);
    PLC2_controller_data = jsondecode(PLC2_Actor_raw_data);
    
    fprintf('-----------------------------------------------\n')

    fileInfo = dir(PLC1_Actor_data_file_path);
    PLC1_time_diff_seconds = round((now - fileInfo.datenum) * 24 * 3600);
    fprintf('> PLC1 time_diff_seconds: %f\n', PLC1_time_diff_seconds);
    fileInfo = dir(PLC2_Actor_data_file_path);
    PLC2_time_diff_seconds = round((now - fileInfo.datenum) * 24 * 3600);
    fprintf('> PLC2 time_diff_seconds: %f\n', PLC2_time_diff_seconds);

    if PLC1_time_diff_seconds > JSON_TIMEOUT || PLC2_time_diff_seconds > JSON_TIMEOUT
        waiting_time = waiting_time + 1;
        fprintf('No connection to PLC1 and PLC2, waiting for connection  %d \n', waiting_time);
    else
        fprintf('> Connection to PLC1 and PLC2, start simulation \n');
        fprintf('\n');
        PLC1_actors = PLC1_controller_data.actors;
        MV_SP = PLC1_controller_data.MV_SP;
        controller_sim_cnt = PLC1_controller_data.sim_cnt;
        PLC2_actors = PLC2_controller_data.actors;

        actors = [PLC2_actors; PLC1_actors];
        if controller_sim_cnt > sim_cnt
            sim_cnt = controller_sim_cnt;
            simualtion_flag = true;
        end
        % jsonwrite(Actor_data_file_path, controller_data);
    end

    if waiting_time > WAIT_TIMEOUT
        fprintf('> Waiting time out, simulation stopped \n');
        fprintf('\n')
        break;
    end
    
    if simualtion_flag

        simualtion_flag = false;
        waiting_time = 0;

        minute = floor(sim_cnt / 6); % 分钟
        iswitch = rem(sim_cnt, 2);
        fprintf('> No. %3d --  Minute: %d \n', sim_cnt, minute);
        fprintf('\n')
        fprintf('---------- Simulation start ------------\n\n')
        fprintf('PI sensors: %.4f, %.4f, %.4f, %.4f\n', PI_sensors(1), PI_sensors(2), PI_sensors(3), PI_sensors(4));
        fprintf('actors: %.4f, %.4f, %.4f, %.4f\n', actors(1), actors(2), actors(3), actors(4));
        fprintf('----------------------------------------\n\n')

        Xfilin(2) = MV_SP(1);
        % % 进料流量控制
        Xfilin(1) = MV_SP(2);
        % % 进料压力控制
        Xfilin(13) = MV_SP(3);

        if iswitch == 1 %Reversed the solution order at each time step
            [Temperatureout, Vaporout, xcout, Liqout, Holdout, EnthalLout, EnthalVout, LN, HN, LCO, Ttrack1, Ttrack2, yout, Pfra, PI_sensors] = Fractionator(xfra, ufra, xc, MV, products, Xfilin, dist, actors);
        else
            [Temperatureout, Vaporout, xcout, Liqout, Holdout, EnthalLout, EnthalVout, LN, HN, LCO, Ttrack1, Ttrack2, yout, Pfra, PI_sensors] = Fractionatori(xfra, ufra, xc, MV, products, yout, Xfilin, dist, actors);
        end

        % Holdout
        xfra = [Holdout; EnthalLout; EnthalVout; Liqout];
        ufra = [Vaporout; Temperatureout];
        xc   = xcout;
        products = [LN; HN; LCO];
        % errord = [ELC2; ETC4; ETC5; ETC6];
        MVfracout  = [MV(1), MV(2), MV(3), MV(4), MV(5), MV(6)];
        Flpg       = (ones(1, 10) * (yout(1, :)' * Vaporout(1))) * (1000/3600); %mol/s
        Tcondenser = Temperatureout(1);
        MWT = [MWm, MWe, MWp, MWb, MWc5, MWp1, MWp2, MWp3, MWp4, MWp5];
        % 按照组分成分计算产品流量，非物质流量
        LPGMB = ((1/3.6) * (1/453.59) * Vaporout(1) * yout(1, :) .* MWT) * ones(10, 1);
        LNMB = ((1/3.6) * (1/453.59) * LN * xcout(1, :) .* MWT) * ones(10, 1);
        HNMB = ((1/3.6) * (1/453.59) * HN * xcout(6, :) .* MWT) * ones(10, 1);
        LCOMB = ((1/3.6) * (1/453.59) * LCO * xcout(13, :) .* MWT) * ones(10, 1);
        SMB = ((1/3.6) * (1/453.59) * Liqout(end) * xcout(20, :) .* MWT) * ones(10, 1);
        Liq1 = ((1/3.6) * (1/453.59) * Liqout(1) * xcout(1, :) .* MWT) * ones(10, 1);

        %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%% Data Collection - FRACTIONATOR %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
        Temperatureout = (Temperatureout - 273.15) * 9/5 + 32;
        Pfra = Pfra * 14.5037744;

        sensors(1)   = LPGMB * 60;  % FI1
        sensors(2)   = Holdout(1);  % LI1
        sensors(3)   = LNMB * 60 ;  % FI2
        sensors(4)   = PI_sensors(2); % TI1
        sensors(5)   = PI_sensors(3); % TI2
        sensors(6)   = PI_sensors(4); % TI3
        sensors(7)   = Temperatureout(20); % TI4
        sensors(8)   = HNMB * 60 ;  % FI3
        sensors(9)   = LCOMB * 60;  % FI4
        sensors(10)  = ((1/3.6) * (1/453.59) * Xfilin(1) * Xfilin(3:12) .* MWT) * ones(10, 1) * 60; % FI5
        sensors(11)  = SMB * 60;    % FI6
        sensors(12)  = Pfra(2) ;    % PI1
        sensors(13)  = Pfra(20);    % PI2
        sensors(14)  = Holdout(20); % LI2
        
        PLC2_sensors = sensors(1 : 4);
        PLC1_sensors = sensors(4 : 14);

    end

    PLC1_sensor_data.sensors = PLC1_sensors;
    PLC1_sensor_data.sim_cnt = sim_cnt;
    fid = fopen(PLC1_Sensor_data_file_path, 'w');
    fwrite(fid, jsonencode(PLC1_sensor_data));
    fclose(fid);
    fprintf('> Sensor data saved to %s\n', PLC1_Sensor_data_file_path);

    PLC2_sensor_data.sensors = PLC2_sensors;
    PLC2_sensor_data.sim_cnt = sim_cnt;
    fid = fopen(PLC2_Sensor_data_file_path, 'w');
    fwrite(fid, jsonencode(PLC2_sensor_data));
    fclose(fid);
    fprintf('> Sensor data saved to %s\n', PLC2_Sensor_data_file_path);
    fprintf('\n')

    pause(sim_period); 

    end
end